cmsis-svd/cmsis-svd/data/HDSC/HC32L157KX.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="MSC0_UART">
            <name>MSC1_UART</name>
            <description>desc MSC_UART</description>
            <baseAddress>0x40038100</baseAddress>
            <alternatePeripheral>MSC1_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x42</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="MSC0_UART">
            <name>MSC2_UART</name>
            <description>desc MSC_UART</description>
            <baseAddress>0x40038200</baseAddress>
            <alternatePeripheral>MSC2_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x42</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="MSC0_UART">
            <name>MSC4_UART</name>
            <description>desc MSC_UART</description>
            <baseAddress>0x40037000</baseAddress>
            <alternatePeripheral>MSC4_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x42</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="MSC0_UART">
            <name>MSC5_UART</name>
            <description>desc MSC_UART</description>
            <baseAddress>0x40037100</baseAddress>
            <alternatePeripheral>MSC5_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x42</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="MSC0_UART">
            <name>MSC6_UART</name>
            <description>desc MSC_UART</description>
            <baseAddress>0x40037200</baseAddress>
            <alternatePeripheral>MSC6_I2C</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x42</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>OSC</name>
            <description>desc OSC</description>
            <baseAddress>0x4002E000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x144</size>
            </addressBlock>
            <registers>
                <register>
                    <name>HICR_TRMKEY</name>
                    <description>desc HICR_TRMKEY</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TRMKEY</name>
                            <description>desc TRMKEY</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HICR_FTRM</name>
                    <description>desc HICR_FTRM</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xBD00BD</resetValue>
                    <resetMask>0x1FF01FF</resetMask>
                    <fields>
                        <field>
                            <name>CR4MFTRM</name>
                            <description>desc CR4MFTRM</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR16MFTRM</name>
                            <description>desc CR16MFTRM</description>
                            <msb>24</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HICR_TTRM</name>
                    <description>desc HICR_TTRM</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80008</resetValue>
                    <resetMask>0xF000F</resetMask>
                    <fields>
                        <field>
                            <name>CR4MTTRM</name>
                            <description>desc CR4MTTRM</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR16MTTRM</name>
                            <description>desc CR16MTTRM</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HICR_FMC</name>
                    <description>desc HICR_FMC</description>
                    <addressOffset>0xC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>FMC</name>
                            <description>desc FMC</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HICR_CSR</name>
                    <description>desc HICR_CSR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>CSR</name>
                            <description>desc CSR</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSXT_PWRCTL</name>
                    <description>desc HSXT_PWRCTL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x30003</resetMask>
                    <fields>
                        <field>
                            <name>HXSEL</name>
                            <description>desc HXSEL</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HIBS</name>
                            <description>desc HIBS</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LSXT_PWRCTL</name>
                    <description>desc LSXT_PWRCTL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x20002</resetValue>
                    <resetMask>0x30003</resetMask>
                    <fields>
                        <field>
                            <name>LCSEL</name>
                            <description>desc LCSEL</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LIBS</name>
                            <description>desc LIBS</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
